## Plan Result (ithc-apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 5 to change, 2 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_api_management.apim
  * module.api-mgmt.azurerm_application_insights.apim
  * module.api-mgmt.azurerm_network_security_group.apim
  * module.api-mgmt.azurerm_public_ip.apim
  * module.api-mgmt.azurerm_route_table.route_table
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "sds-api-mgmt-ithc"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "ss-ithc-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tags                      = (known after apply)
      + tenant_access             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-ithc"
        name                          = "sds-api-mgmt-ithc"
      ~ tags                          = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-ithc" -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-ithc/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_application_insights.apim will be updated in-place
  ~ resource "azurerm_application_insights" "apim" {
        id                                    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-ithc"
        name                                  = "sds-api-mgmt-ithc"
      ~ tags                                  = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_network_security_group.apim will be updated in-place
  ~ resource "azurerm_network_security_group" "apim" {
        id                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/networkSecurityGroups/sds-api-mgmt-ithc-nsg"
        name                = "sds-api-mgmt-ithc-nsg"
      ~ tags                = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_public_ip.apim will be updated in-place
  ~ resource "azurerm_public_ip" "apim" {
        id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-ithc-private-pip"
        name                    = "sds-api-mgmt-ithc-private-pip"
      ~ tags                    = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc/providers/Microsoft.Authorization/roleAssignments/634ed2d1-fa7b-53c7-8800-f8e0f05b412e" -> (known after apply)
      ~ name                             = "634ed2d1-fa7b-53c7-8800-f8e0f05b412e" -> (known after apply)
      ~ principal_id                     = "6509704f-165c-4748-8338-3b19a20990e1" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_route_table.route_table will be updated in-place
  ~ resource "azurerm_route_table" "route_table" {
        id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/routeTables/sds-api-mgmt-ithc-route-table"
        name                          = "sds-api-mgmt-ithc-route-table"
      ~ tags                          = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":345,"Program":"tfcmt","SHA1":"","Target":"ithc-apim","Vars":{}} -->